;; -*- no-byte-compile: t; -*-
;;; private/tt/packages.el

(package! wakatime-mode)
(package! ag)
(package! dumb-jump)
(package! spaceline-all-the-icons)
(package! spaceline)
(package! company-box)
(package! lsp-mode)
(package! lsp-ui)
(package! lsp-javascript-typescript)
(package! lsp-python)
(package! tide)
(package! company-childframe :disable t)
(package! posframe :disable t)
(package! tern :disable t)
(package! company-tern :disable t)
(package! company-lsp)
(package! challenger-deep-theme)
(package! manage-minor-mode)
(package! flow-minor-mode)
(package! prettier-js)
(package! ansi-color)
