;; -*- no-byte-compile: t; -*-
;;; private/tt/packages.el

(package! wakatime-mode)
(package! ag)
(package! dumb-jump)
(package! spaceline-all-the-icons)
(package! spaceline)
(package! company-box)
(package! lsp-mode)
(package! company-lsp)
(package! challenger-deep-theme)
(package! manage-minor-mode)
(package! json-mode)
(package! flow-minor-mode)
(package! prettier-js)
(package! ansi-color)
